ТОИР_демо/src/InformationRegisters/торо_СтатусыОбъектовРемонтаВУчете/торо_СтатусыОбъектовРемонтаВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыОбъектовРемонтаВУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОР</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/InformationRegisters/торо_СтатусыОбъектовРемонтаВУчете/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Функция - Получить текущий статус ОР
//
// Параметры:
//		ОР	 - СправочникСсылка.торо_ОбъектыРемонта - Объект ремонта статус которого хотим получить.
//    ДатаСреза - Дата - дата, на которую нужно получить статус.
// Возвращаемое значение:
//  Перечисления.торо_СтатусыОРВУчете - Текущий статус объекта ремонта.
Функция ПолучитьТекущийСтатусОР(ОР, ДатаСреза = Неопределено) Экспорт
	Если ДатаСреза = Неопределено Тогда
		ТаблицаЗначений = РегистрыСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних(,Новый Структура("ОбъектРемонта", ОР));
	Иначе
		ТаблицаЗначений = РегистрыСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних(Новый Граница(ДатаСреза,ВидГраницы.Включая), Новый Структура("ОбъектРемонта", ОР));
	КонецЕсли; 
	
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Выборка = ТаблицаЗначений[0];
		Возврат Выборка.СтатусОР;
	Иначе
		Возврат Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету;
	КонецЕсли; 
	
КонецФункции
#КонецОбласти
